
#define _CRT_SECURE_NO_WARNINGS
#include <conio.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include <windows.h>

inline bool IsKeyDown(int Key)
{
	return (GetKeyState(Key) & 0x8000) != 0;
}

int main()
{
	
	system("chcp 1251");
	system("cls");
	double x1, x2, delta, x,y,y2;
	unsigned int N,variant, n;
	do {
		printf(" Введіть свій варіант (1 або 2): \n");
		scanf("\t%u", &variant);
		printf(" Ви обрали варіант: %u", variant);
		if(variant != 1 && variant != 2)
		{
			fprintf(stdout, "%s\n ", "\t \nБуло введено неправильний варіант.");		
		}
	} while (variant != 1 && variant != 2);

	if (variant == 1)
	{
		printf(" Введіть  початкове значення аргументу x1- ");
		scanf("%lf",&x1);

		printf(" Введіть кінцеве значення аргументу x2- ");
		scanf("%lf", &x2);

		printf(" Введіть значення кількості точок таблиці N- ");
		scanf("%u", &N); 
		do
		{
			if (N != 0)
			{
				delta = (x2 - x1) / (N - 1);
			}
			else
			{
				printf(" Введіть значення кількості точок таблиці N(воно не може бути 0)- ");
				scanf("%u", &N);				
			}
		} while (N == 0);
		system("cls");
		y = 2 * x1;
		y2 = 2 * x2;
		printf(" Ви ввели: %s %lf %s %lf %s %u\n","\nПочаткове значення аргументу x1 - ", x1,"\nКінцеве значення аргументу x2- ", x2, "\nКількость точок таблиці N- ", N);
		printf("F(x) = 2 * x1, F(x) = 2 * x2\n");
		printf("-----------------------------------------\n");
		printf("      N     |      X     |     F(X)       \n"
			"-------------+--------------+-------------\n");
		printf("%s %u %s %lf %s %lf %s "," ", N, "          |",          x1,    "|",    y, "|",      "\n"
			"-------------+--------------+-------------\n");
		
		
		printf("           |           |            \n"
			"-------------+--------------+-------------\n");
		printf("%s %u %s %lf %s %lf %s "," ", N, "          |",          x2,    "|",    y2,"|",      "\n"
			"-------------+--------------+-------------\n");
		//while (true) // cikl
		//{


		//	if (IsKeyDown(VK_RETURN))
		//	{

		//		printf("           |           |            \n"
		//			"-------------+--------------+-------------\n");
		//		printf("%s %u %s %lf %s %lf %s ", " ", N, "      | ", x2, "| ", y2, "|", "\n"
		//			"-------------+--------------+-------------\n");
		//		printf("           |           |            \n"
		//			"-------------+--------------+-------------\n");
		//		printf("%s %u %s %lf %s %lf %s ", " ", N, "      | ", x1, "| ", y, "|", "\n"
		//			"-------------+--------------+-------------\n");
		//		system("cls");
		//		printf("           |           |            \n"
		//			"-------------+--------------+-------------\n");
		//		printf("%s %u %s %lf %s %lf %s ", " ", N, "      | ", x2, "| ", y2, "|", "\n"
		//			"-------------+--------------+-------------\n");
		//		printf("           |           |            \n"
		//			"-------------+--------------+-------------\n");
		//		printf("%s %u %s %lf %s %lf %s ", " ", N, "      | ", x1, "| ", y, "|", "\n"
		//			"-------------+--------------+-------------\n");
		//	}
		//	else if (IsKeyDown(VK_ESCAPE))
		//	{
		//		break;
		//	}

		//}
		


	}
	else if (variant == 2)
	{
		printf(" Введіть початкове значення аргументу x1- ");
		scanf("%lf", &x1);

		printf(" Введіть кінцеве значення аргументу x2- ");
		scanf("%lf", &x2);

		printf(" Введіть крок зміни аргументу delta- ");
		scanf("%lf", &delta);

		do {
			
			if (delta != 0)
			{
				N = 1 + (x2 - x1) / delta;
				
			}
			else
			{
				printf(" delta не може бути 0 ");
				printf(" Введіть крок зміни аргументу delta- ");
				scanf("%lf", &delta);
			}
		} while (delta == 0);
		system("cls");	
		printf(" Ви ввели: %s %lf %s %lf %s %lf\n", "\nПочаткове значення аргументу x1 - ", x1, "\nКінцеве значення аргументу x2- ", x2, "\nKрок зміни аргументу delta- ", delta);

		y = 2 * x1;
		y2 = 2 * x2;
		printf("-----------------------------------------\n");
		printf("      N     |      X     |     F(X)       \n"
			"-------------+--------------+-------------\n");
		printf("%s %u %s %lf %s %lf %s ",  " ", N, "      | ", x1, "| ", y, "|", "\n"
			"-------------+--------------+-------------\n");


		printf("           |           |            \n"
			"-------------+--------------+-------------\n");
		printf("%s %u %s %lf %s %lf %s ",  " ", N, "      | ", x2, "| ", y2, "|", "\n"
			"-------------+--------------+-------------\n");

		

		//while (true) // cikl
		//{
		//	
		//	
		//	if (IsKeyDown(VK_RETURN))
		//	{
		//		printf("           |           |            \n"
		//			"-------------+--------------+-------------\n");
		//		printf("%s %u %s %lf %s %lf %s ", " ", N, "      | ", x1, "| ", y, "|", "\n"
		//			"-------------+--------------+-------------\n");
		//		system("cls");
		//		printf("           |           |            \n"
		//			"-------------+--------------+-------------\n");
		//		printf("%s %u %s %lf %s %lf %s ", " ", N, "      | ", x2, "| ", y2, "|", "\n"
		//			"-------------+--------------+-------------\n");
		//	}
		//	else if (IsKeyDown(VK_ESCAPE))
		//	{
		//		break;
		//	}
		//	
		//}


	}
		return 0;
}

